Repository: nicklambson/bitcoin-multilingual
Catalog: alignments/bitcoin-is-time/Bitcoin is Time_es.tmx
Source language: en_us
Languages: es

source: Bitcoin Is Time
es: Bitcoin es tiempo

source: One luminary clock against the sky Proclaimed the time was neither wrong nor right.
es: “Un luminoso reloj recortado en el cielo Proclamó que la hora no estaba ni bien ni mal.”

source: Robert Frost, Acquainted with the Night (1928)
es: - Robert Frost, Un conocido de la noche (1928)

source: Time is still the great mystery to us.
es: “El tiempo es todavía un gran misterio para nosotros.

source: It is no more than a concept; we don’t know if it even exists…
es: No es más que un concepto; ni siquiera sabemos si existe…”

source: Clifford D. Simak, Shakespeare’s Planet (1976)
es: Clifford D. Simak, El planeta de Shakespeare (1976)

source: Time is money, or so the saying goes.
es: El tiempo es dinero, o así dice el dicho.

source: It follows that money is also time:
es: Se concluye que el dinero es también tiempo:

source: a representation of the collective economic energy stored by humanity.
es: una representación de la energía colectiva almacenada por la humanidad.

source: However, the link between time and money is more intricate than it might seem at first.
es: No obstante, la relación entre tiempo y dinero es más compleja de lo que puede parecer en un principio.

source: If money requires no time to create, it doesn’t work as money very well, or not for long.
es: Si el dinero no necesita de tiempo para ser creado, no funciona como dinero muy bien, o al menos no por mucho tiempo.

source: More profoundly, as we shall see, keeping track of things in the informational realm always implies keeping track of time.
es: Más profundamente, como veremos, mantener un seguimiento de las cosas en el reino de la información siempre implica tener un seguimiento del tiempo.

source: As soon as money goes digital, we have to agree on a definition of time, and herein lies the whole problem.
es: Tan pronto como el dinero se vuelva digital, vamos a tener que estar de acuerdo en una definición de tiempo, y he aquí el gran problema.

source: You might think telling the time is as easy as glancing at whatever clock is nearby, and you would be right when it comes to everyday tasks.
es: Podrías pensar que decir la hora es tan fácil como mirar cualquier reloj que tengas cerca, y vas a estar en lo correcto en lo que refiere a tareas cotidianas.

source: But when it comes to synchronizing the state of a global, adversarial, distributed network, telling the time becomes an almost intractable problem.
es: Pero cuando quieras sincronizar el estado de una red distribuida, global y adversa, decir cual es el tiempo se convierte en un problema casi sin solución.

source: How do you tell the time if clocks can’t be trusted?
es: ¿Cómo sabes la hora si no puedes confiar en los relojes?

source: How do you create the concept of a singular time if your system spans the galaxy?
es: ¿Cómo creas el concepto de un único tiempo si tu sistema ocupa toda una galaxia?

source: How do you measure time in a timeless realm?
es: ¿Cómo mides la hora en un reino sin tiempo?

source: And what is time anyway?
es: Y por cierto ¿Qué es el tiempo de todas formas?

source: To answer these questions, we will have to take a closer look at the concept of time itself and how Bitcoin makes up its own time:
es: Para responder a estas preguntas, vamos a tener que dar una mirada más cercana al concepto del tiempo propiamente dicho y cómo Bitcoin logra generar su propio tiempo:

source: block time — more commonly known as block height.
es: el tiempo de bloque - más comúnmente llamado altura de bloque.

source: We will explore why the problem of timekeeping is intimately related to keeping records, why there is no absolute time in a decentralized system, and how Bitcoin uses causality and unpredictability to build its own sense of now.
es: Vamos a explorar por qué el problema de medir el tiempo está íntimamente relacionado a mantener registros, por que no hay un tiempo absoluto en un sistema descentralizado, y como Bitcoin usa la causalidad y la impredictibilidad para construir su propio sentido del ahora.

source: Timekeeping devices have transformed civilizations more than once.
es: Los artefactos que miden el tiempo han transformado a las civilizaciones más de una vez.

source: As Lewis Mumford pointed out in 1934:
es: Como dijo Lewis Mumford en 1934:

source: “The clock, not the steam-engine, is the key-machine of the modern industrial age.”
es: “El reloj, no el motor a vapor, es la maquinaria clave para la era industrial moderna.”

source: Today, it is again a timekeeping device that is transforming our civilization:
es: Hoy, nuevamente un artefacto que mide el tiempo está transformando nuestra civilización:

source: a clock, not computers, is the true key-machine of the modern informational age.
es: un reloj, no las computadoras, es la verdadera maquinaria clave de la era moderna de la información.

source: And this clock is Bitcoin.
es: Este reloj es Bitcoin.

source: Keeping Track of Things Let the child learn to count things, thus getting the notion of number.
es: Haciendo un seguimiento de las cosas “Deja que los niños aprendan a contar cosas, entonces van a comprender solos la noción del número.

source: These things are, for the purpose of counting, considered alike, and they may be single objects or groups.
es: Estas cosas son, dentro del propósito de contar, las mismas, y pueden ser objetos únicos o grupos.”

source: David Eugene Smith, The Teaching of Elementary Mathematics (1900)
es: - David Eugene Smith, La enseñanza de matemáticas elementales (1900)

source: Very broadly speaking, there are two ways to keep track of things:
es: Hablando muy por encima, hay dos formas de hacer seguimiento de cosas:

source: physical tokens and ledgers.
es: usando tokens físicos (fichas, monedas) o libros contables.

source: You can either use real-world artifacts directly, e.g., give someone a sea shell, a coin, or some other tangible thing, or you can replicate the state of the world by writing down what happened on a piece of paper.
es: Puedes usar tanto cosas del mundo real, por ejemplo, le das a alguien un caracol de mar, una moneda, o alguna otra cosa tangible, o puedes replicar el estado del mundo escribiendo qué sucedió en un pedazo de papel.

source: Imagine you are a shepherd and want to make sure that your whole flock returned home.
es: Imagina que eres un pastor y quieres asegurarte que todo tu rebaño volvió a casa.

source: You can put a collar on each sheep, and as soon as a sheep returns home, you simply remove the collar and hang it up in your shed.
es: Puedes poner un collar en cada oveja, y tan pronto como una oveja vuelve, simplemente le sacas el collar y lo cuelgas.

source: If you have one hanger for every collar, you will know that every sheep returned safely as soon as all hangers are filled.
es: Si tienes un gancho para cada collar, puedes saber que todas las ovejas volvieron tan pronto como todos los ganchos estén ocupados.

source: Of course, you can also count them and keep a list.
es: Por supuesto, también puedes contarlas y mantener una lista.

source: However, you will have to make sure to create a new list every time you start counting, and you will also have to make sure not to count a single sheep twice (or not at all).
es: Sin embargo, tienes que asegurarte de crear una nueva lista cada vez que empiezas a contar, y también tienes que asegurarte de no contar a una misma oveja más de una vez (o de no contarla).

source: Money is essentially a tool to keep track of who owes what to whom.
es: El dinero es esencialmente una herramienta para hacer un seguimiento de quién le debe a quién.

source: Broadly speaking, everything we have used as money up to now falls into two categories:
es: En general, todo lo que hemos usado como moneda hasta ahora cae en dos categorías:

source: physical artifacts and informational lists.
es: artefactos físicos y listas de información.

source: Or, to use more common parlance:
es: O, para usar palabras más comunes:

source: tokens and ledgers.
es: tokens o libros contables.

source: It is important to realize the inherent difference of these categories, so let me point it out explicitly:
es: Es importante entender la diferencia inherente de estas categorías, así que déjame dejarlas claras explícitamente:

source: The first method — a physical token — directly represents the state of things.
es: El primer método -un token físico- representa directamente el estado de las cosas.

source: The second one — a ledger — indirectly reflects the state of things.
es: El segundo -un libro contable- refleja indirectamente el estado de las cosas.

source: Each comes with advantages and disadvantages.
es: Cada uno viene con sus ventajas y desventajas.

source: For example, tokens are physical and distributed; ledgers are informational and centralized.
es: Por ejemplo, los tokens son físicos y distribuidos; los libros contables son informacionales y centralizados.

source: Tokens are inherently trustless; ledgers are not.
es: Los tokens inherentemente no requieren de confianza; los libros contables si.

source: In the digital realm — no matter how intensely marketing gurus try to convince you of the opposite — we can only use ledgers.
es: En el mundo digital -no importa cuán intensamente los publicistas intenten convencerte de lo contrario- solo podemos usar libros contables.

source: It is an informational realm, not a physical one.
es: Es un reino de información, no un reino físico.

source: Even if you call a certain kind of information a “token,” it is still a malleable piece of information, written down on a hard drive or some other medium that can hold information, effectively rendering it an informational record.
es: Aunque puedas llamar a un cierto tipo de información “token”, todavía sigue siendo una pieza de información maleable, escrita en un disco rígido o algún otro medio que puede almacenar información, efectivamente convirtiéndolo en un registro de información.

source: The ledger-like nature of all digital information is the root cause of the double-spend problem.
es: La naturaleza tipo-registro-contable de toda la información digital es la causa raíz del problema del doble-gasto.

source: information never represents the state of the world directly.
es: La información nunca representa el estado del mundo directamente.

source: Further, the movement of information implies copying.
es: Además, el movimiento de información implica copiar.

source: information exists in one place, and to “move” it, you have to copy it to another place and erase it at its origin.
es: La información existe en un lugar, y para “moverla”, tienes que copiarla a otro lugar y borrarla de su origen.

source: This problem doesn’t exist in the physical realm.
es: Este problema no existe en el mundo físico.

source: In the physical realm, we can actually move things from A to B. The informational realm doesn’t have this property.
es: En el mundo físico, podemos mover cosas desde A hacia B. El reino de la información no tiene esta propiedad.

source: If you want to “move” information from list A to list B, you have to copy it from A to B. There is no other way.
es: Si quieres “mover” información de la lista A hacia la lista B, tienes que copiarla de A hacia B. No hay otra manera.

source: Another way to think about it is in terms of uniqueness.
es: Otra manera de pensarlo es en términos de unicidad.

source: Physical tokens are unique composites of atoms whose assembly is not easily replicable.
es: Los tokens físicos son compuestos únicos de átomos cuya forma no es fácilmente replicable.

source: Pure information does not have this property.
es: La información pura no tiene esta propiedad.

source: If you can read the information, you can also copy it perfectly.
es: Si puedes leer la información, también puedes copiarla perfectamente.

source: Practically speaking, it follows that physical tokens are unique, and digital tokens are not.
es: En términos prácticos, los tokens físicos son únicos, un token digital no.

source: I would even argue that “digital token” is a misnomer.
es: Me atrevería a decir que “token digital” es un término equivocado.

source: A token might represent secret information, but it will never represent unique, singular, uncopyable information.
es: Un token puede representar una información secreta, pero nunca puede representar información única, puntual e incopiable.

source: This difference in properties shows that there really is no way to “hand over” information.
es: Esta diferencia en propiedades muestra que no hay forma de “entregar” información.

source: It is impossible to pass on a digital token like you would pass on a physical one since you can never be sure if the original owner destroyed the information on his end.
es: Es imposible transferir un token digital cómo transferimos uno físico ya que nunca podrías estar seguro de si el dueño original destruyó la información de su lado.

source: Digital tokens, like all information, can only be spread, like an idea.
es: Un token digital, como toda información, solo puede ser propagada, como una idea.

source: … if you have an apple and I have an apple, and we swap apples — we each end up with only one apple.
es: “... si tu tienes una manzana y yo tengo una manzana, y cambiamos manzanas -ambos nos quedamos con una manzana.

source: But if you and I have an idea and we swap ideas — we each end up with two ideas.
es: Pero si tu y yo tenemos una idea y cambiamos ideas -ambos terminamos con dos ideas.”

source: Physical tokens — what we call physical bearer assets, or “cash” — are free from this dilemma.
es: Los tokens físicos -los que comúnmente llamamos activo al portador, o “efectivo”- no se enfrentan a este dilema.

source: In the real world, if you hand me a coin, your coin is gone.
es: En el mundo real, si me das una moneda, tu moneda desaparece.

source: There is no magical duplication of the coin, and the only way to give it to me is to physically hand it over.
es: No hay una forma de duplicación mágica de las monedas, y el único modo de dármela es trasladándola físicamente.

source: The laws of physics do not allow you to double-spend it.
es: Las leyes de la física no te permiten hacer un doble-gasto.

source: While double-spending does exist in the non-digital realm — George Parker, a con artist who famously “double-spent” the Brooklyn Bridge and other landmarks comes to mind — it requires elaborate deception and gullible buyers.
es: Existe el doble-gasto en el mundo no-digital -George Parker, por ejemplo, un estafador que hizo “doble-gasto” vendiendo a muchas personas el puente de Brooklyn. Y hay más ejemplos- requiere una elaborada red de engaños y compradores crédulos.

source: Not so in the digital realm.
es: No es así en el mundo digital.

source: In the digital realm, because we are always dealing with information, double-spending is an inherent problem.
es: En el mundo digital, debido a que estamos utilizando información, hacer un doble-gasto es un problema inherente.

source: As everyone who ever copied a file or used copy-and-paste knows, information is something that you can copy perfectly, and it is not bound to the medium that hosts it.
es: Todos los que alguna vez copiamos un archivo o utilizamos el copiar-pegar lo sabemos, la información es algo que puedes copiar perfectamente, y no está atada al medio que lo almacena.

source: If you have a digital photograph, for example, you can copy it a million times, store some copies on a USB stick, and send it to thousands of different people.
es: Si tienes una fotografía digital, por ejemplo, puedes copiarla un millón de veces, guardar algunas copias en un USB y enviarla a miles de personas diferentes.

source: Perfect copies are possible because information allows for flawless error correction, which eliminates degradation.
es: Copias perfectas son posibles debido a que la información permite corrección de errores sin fallas, lo que elimina la degradación.

source: And to top things off, there is virtually no cost to duplication and no way to tell what the original was.
es: Y encima de todo esto, no hay un costo por la duplicación y no hay forma de saber cuál era la original.

source: Again:
es: De nuevo:

source: when it comes to information, copying is all there is.
es: cuando se trata de información, copiar es todo lo que hay.

source: There simply is no way to move digital information from A to B. information is always copied from A to B, and if the copying process was successful, the original copy of A is deleted.
es: Simplemente no hay una forma de mover información digital desde A hasta B. La información siempre es copiada desde A hasta B, y si el proceso de copiado fue exitoso, la copia original de A es eliminada.

source: This is why the double-spending problem is so tricky.
es: Este es el motivo por el cual el problema de doble-gasto es tan tramposo.

source: Absent of a central authority, there is no way to move anything from A to B in a trustless manner.
es: En ausencia de una autoridad central no hay forma de mover algo de A a B sin confianza.

source: You always have to trust that the original will be deleted.
es: Siempre tienes que confiar que el original va a ser eliminado.

source: A natural side-effect is that, when it comes to digital information, it is impossible to tell how many copies are in existence and where these copies might be.
es: Un efecto colateral natural es que, cuando se trata de información digital, es imposible decir cuántas copias existen y dónde estas copias pueden estar.

source: Because of this, using digital “tokens” as money can not and will never work.
es: Debido a esto, usar “tokens” digitales como dinero no puede funcionar y nunca lo hará.

source: Since tokens derive their reliability from being hard to reproduce as a result of their unique physical construction, this advantage disappears in the digital realm.
es: Ya que la fiabilidad de los tokens reside en la dificultad en ser reproducidos como resultado de su construcción física única, esta ventaja desaparece en el reino digital.

source: In the digital realm, tokens cannot be trusted.
es: En el reino digital, los tokens no son confiables.

source: As a result of the nature of information’s intrinsic properties, the only viable format for digital money is not a token but a ledger — which brings us to the problem of time.
es: Como resultado de la naturaleza de las propiedades intrínsecas de la información, el único formato viable para el dinero digital es no ser un token sino un libro contable - lo que nos lleva al problema del tiempo.

source: Tokens Are Timeless, Ledgers Are Not
es: Los tokens son para siempre, los libros contables no

source: For the things seen are temporary, but the things unseen are everlasting.
es: “Las cosas que se ven son temporales, pero las que no se ven son eternas.”

source: Paul of Tarsus, Corinthians 4:18b
es: - Pablo de Tarsu, Corintios 4:18b

source: When it comes to physical tokens, the time of a transaction does not matter.
es: Cuando hablamos de tokens físicos, la hora de la transacción no importa.

source: You either have the coins in your pocket, or you don’t; you can either spend them, or you can’t.
es: O bien tienes las monedas en tu bolsillo, o no las tienes; puedes gastarlas, o no puedes.

source: The simple act of possession is the only prerequisite for spending.
es: El simple acto de posesión es el único prerrequisito para gastar.

source: The laws of nature take care of the rest.
es: Las leyes de la naturaleza hacen el resto.

source: In that sense, physical tokens are trustless and timeless.
es: En ese sentido, los tokens físicos no requieren de confianza ni del tiempo.

source: When it comes to ledgers, physical possession falls to the wayside.
es: Cuando hablamos de los libros contables, la posesión física se desploma.

source: Whoever is in control of the ledger needs to make sure that things are in order.
es: Quien sea que tiene el control del libro contable tiene que asegurarse de que las cosas están en orden.

source: What is otherwise given by physical laws, namely that you can’t spend money that you don’t have and you can’t spend money that you have already spent previously, has to be enforced by man-made rules.
es: Lo que es dado en el otro lado por las leyes de la física, digamos que no puedes gastar algo que no tienes y que no puedes gastar dinero que ya gastaste antes, tiene que ser provisto por reglas hechas por seres humanos.

source: It is these rules that govern the orderly operation and maintenance of a ledger, not physical laws.
es: Esas son las reglas que gobiernan el orden de operación y mantenimiento de un libro contable, no las leyes físicas.

source: Moving from physical laws to man-made rules is the crux of the matter.
es: Salir de las leyes de la física es lo esencial del asunto.

source: Man-made rules can be bent and broken, physical laws not so much.
es: Las reglas hechas por seres humanos pueden doblarse y romperse, las reglas físicas no mucho.

source: For example, you can’t simply “make up” a physical gold coin.
es: Por ejemplo, no puedes simplemente “crear” una moneda física de oro.

source: You have to dig it out of the ground.
es: Tienes que cavar el suelo y encontrarla.

source: You can, however, absolutely make up a gold coin on paper.
es: Puedes, sin embargo, hacer una moneda de oro en un papel.

source: To do this, you simply add an entry to the ledger and give yourself a couple of coins.
es: Para hacer esto, agregas una nueva entrada en tu libro contable y te das a ti mismo algunas monedas.

source: Or, in the case of central banks, simply add a couple trillion with a few computer keystrokes.
es: Como en el caso de los bancos centrales, agregas algunos trillones usando las teclas en una computadora.

source: Fancy financial people call this “Rehypothecation,” “Fractional Reserve Banking,” or “Quantitative Easing” — but don’t be fooled, it’s all the same:
es: Los términos bonitos que usa la gente de finanzas para esto es “Rehipotecación”, “Banca de reserva fraccionaria” o “Facilitación cuantitativa”- pero no te dejes engañar, todo significa lo mismo:

source: making up money.
es: crear dinero.

source: To keep ledgers and those who manipulate them honest, regular, independent audits are required.
es: Para mantener a los libros contables y a los que los administran honestos, se necesita de auditores independientes.

source: The ability to account for every single entry in a ledger is not a luxury.
es: La habilidad de chequear cada una de las líneas de un libro contable no es un lujo.

source: Auditors need to be able to go over the books — backward in time — to keep ledgers honest and functioning.
es: Los auditores necesitan poder recorrer todos los libros -hacia atrás en el tiempo- para mantener a los libros contables honestos y funcionando.

source: Without reliable timestamps, verifying the internal consistency of a ledger is impossible.
es: Sin marcas de tiempo precisas, verificar la consistencia interna de un libro contable es imposible.

source: A mechanism to establish an unambiguous order is essential.
es: Un mecanismo para establecer un orden no ambiguo es esencial.

source: Without an absolute sense of time, there is no way to have a defined order of transaction.
es: Sin un sentido absoluto del tiempo, no hay forma de definir un orden en las transacciones.

source: And without a defined order of transactions, the rules of a ledger can not be followed.
es: Y sin un orden definido de transacciones, las reglas de un libro contable no se pueden seguir.

source: How else can you make sure how much money you actually have?
es: ¿Cómo sería posible de otra forma saber cuanto dinero tienes?
